Revit 2027 API
FabricationRodInfo.GetRodStructureExtension Method
 Gets the length of the rod's top extension into structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetRodStructureExtension(
	int rodIndex
)
Public Function GetRodStructureExtension (
	rodIndex As Integer
) As Double
public:
double GetRodStructureExtension(
	int rodIndex
)
member GetRodStructureExtension :
        rodIndex : int -> float
Parameters
rodIndex Int32
 The rod index.
Return Value
Double
 Returns the extension length that will be applied if the rod is attached to structure.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace